# -*- coding: UTF-8 -*-

start_greet = ['又是元气满满的一天啊！','主人，有什么吩咐?','我是主人的小红转，哪里需要哪里搬','主人，请下达指令','咩咩咩,叫人家有什么事啊']
bye_greet = ['主人再见，记得有事叫我','那你一个人注意安全','独单的时候有我常在','拜拜,下次再联系']
other_greet = ['听不懂你在说什么呢','现在只有这几个模式可以选择哦','我要生气了','别闹行不行']
model_greet = ['进入走路模式后，你可以实现定位，搜索地点，导航等功能，说出关键字立刻体验','读万卷书，行万里路。小欧带你读尽天下书。','生活缺少乐趣?你想要什么?大声告诉我','家是温暖的港湾，多跟家人说说话。']
err_greet = ['小欧走丢了，马上回来','太难了，人家看不懂哦','好无聊啊','再说一遍好不好']
location = '火星'
streetLocation = '地球'
endLocation = '月球'
walkLine = []
gpu_msg = ''
chat_msg = ''
master_msg = ''
flag = True
